In [13]:
zee_movies = pd.read_fwf("zee-movies.dat",encoding="ISO-8859-1")

In [14]:
zee_ratings =pd.read_fwf("zee-ratings.dat",encoding="ISO-8859-1")

In [15]:
zee_users = pd.read_fwf("zee-users.dat",encoding="ISO-8859-1")

In [16]:
# zee_users

In [17]:
delimiter ="::"

zee_users = zee_users["UserID::Gender::Age::Occupation::Zip-code"].str.split(delimiter,expand = True)
zee_users.columns = ["UserID","Gender","Age","Occupation","Zipcode"]

In [18]:
# zee_users

In [19]:
# zee_ratings

In [20]:
delimiter ="::"

zee_ratings = zee_ratings["UserID::MovieID::Rating::Timestamp"].str.split(delimiter,expand = True)
zee_ratings.columns = ["UserID","MovieID","Rating","Timestamp"]

In [21]:
# zee_ratings

In [22]:
zee_movies.drop(["Unnamed: 1","Unnamed: 2"],axis = 1,inplace=True)
# zee_movies.sample(2)

In [23]:
delimiter ="::"

zee_movies = zee_movies["Movie ID::Title::Genres"].str.split(delimiter,expand = True)
zee_movies.columns = ["MovieID","Title","Genres"]

In [47]:
zee_movies.head(5)

  MovieID                               Title                        Genres
0       1                    Toy Story (1995)   Animation|Children's|Comedy
1       2                      Jumanji (1995)  Adventure|Children's|Fantasy
2       3             Grumpier Old Men (1995)                Comedy|Romance
3       4            Waiting to Exhale (1995)                  Comedy|Drama
4       5  Father of the Bride Part II (1995)                        Comedy

In [48]:
zee_movies.shape

(3883, 3)

In [50]:
zee_ratings.head(5)

  UserID MovieID Rating  Timestamp
0      1    1193      5  978300760
1      1     661      3  978302109
2      1     914      3  978301968
3      1    3408      4  978300275
4      1    2355      5  978824291

In [34]:
zee_ratings

        UserID MovieID Rating  Timestamp
0            1    1193      5  978300760
1            1     661      3  978302109
2            1     914      3  978301968
3            1    3408      4  978300275
4            1    2355      5  978824291
...        ...     ...    ...        ...
1000204   6040    1091      1  956716541
1000205   6040    1094      5  956704887
1000206   6040     562      5  956704746
1000207   6040    1096      4  956715648
1000208   6040    1097      4  956715569

[1000209 rows x 4 columns]

In [49]:
zee_users.shape

(6040, 5)

In [27]:
zee_users.sample(5)

     UserID Gender Age Occupation Zipcode
5182   5183      F  18         20   45202
5068   5069      F  56          0   95062
1322   1323      F  35          2   11218
2446   2447      M  25         14   03051
772     773      M  25          6   48108

In [33]:
zee_movies.shape,zee_ratings.shape,zee_users.shape

((3883, 3), (1000209, 4), (6040, 5))

In [51]:
df = zee_users.merge(zee_ratings,how="outer",on="UserID").merge(zee_movies,
                                                         how = "outer",
                                                         on="MovieID")

In [52]:
df

,UserID,Gender,Age,Occupation,Zipcode,MovieID,Rating,Timestamp,Title,Genres
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama
...,...,...,...,...,...,...,...,...,...,...
1000381,NaN,NaN,NaN,NaN,NaN,3650,NaN,NaN,Anguish (Angustia) (1986),Horror
1000382,NaN,NaN,NaN,NaN,NaN,3750,NaN,NaN,Boricua's Bond (2000),Drama
1000383,NaN,NaN,NaN,NaN,NaN,3829,NaN,NaN,Mad About Mambo (2000),Comedy|Romance
1000384,NaN,NaN,NaN,NaN,NaN,3856,NaN,NaN,Autumn Heart (1999),Drama
1000385,NaN,NaN,NaN,NaN,NaN,3907,NaN,NaN,"Prince of Central Park, The (1999)",Drama

In [53]:
df.shape

(1000386, 10)

In [54]:
df.isna().sum()

UserID         177
Gender         177
Age            177
Occupation     177
Zipcode        177
MovieID          0
Rating         177
Timestamp      177
Title            0
Genres        4066
dtype: int64

In [66]:
df["Title"]

0          One Flew Over the Cuckoo's Nest (1975)
1          One Flew Over the Cuckoo's Nest (1975)
2          One Flew Over the Cuckoo's Nest (1975)
3          One Flew Over the Cuckoo's Nest (1975)
4          One Flew Over the Cuckoo's Nest (1975)
                            ...
1000381                 Anguish (Angustia) (1986)
1000382                     Boricua's Bond (2000)
1000383                    Mad About Mambo (2000)
1000384                       Autumn Heart (1999)
1000385        Prince of Central Park, The (1999)
Name: Title, Length: 1000386, dtype: object

In [71]:
import re

In [83]:
df["movie_release_year"] = df["Title"].str.extract('^(.+)\s\(([0-9]*)\)$',expand = True)[1]

In [84]:
df

,UserID,Gender,Age,Occupation,Zipcode,MovieID,Rating,Timestamp,Title,Genres,movie_release_year
0,1,F,1,10,48067,1193,5,978300760,One Flew Over the Cuckoo's Nest (1975),Drama,1975
1,2,M,56,16,70072,1193,5,978298413,One Flew Over the Cuckoo's Nest (1975),Drama,1975
2,12,M,25,12,32793,1193,4,978220179,One Flew Over the Cuckoo's Nest (1975),Drama,1975
3,15,M,25,7,22903,1193,4,978199279,One Flew Over the Cuckoo's Nest (1975),Drama,1975
4,17,M,50,1,95350,1193,5,978158471,One Flew Over the Cuckoo's Nest (1975),Drama,1975
...,...,...,...,...,...,...,...,...,...,...,...
1000381,NaN,NaN,NaN,NaN,NaN,3650,NaN,NaN,Anguish (Angustia) (1986),Horror,1986
1000382,NaN,NaN,NaN,NaN,NaN,3750,NaN,NaN,Boricua's Bond (2000),Drama,2000
1000383,NaN,NaN,NaN,NaN,NaN,3829,NaN,NaN,Mad About Mambo (2000),Comedy|Romance,2000
1000384,NaN,NaN,NaN,NaN,NaN,3856,NaN,NaN,Autumn Heart (1999),Drama,1999
1000385,NaN,NaN,NaN,NaN,NaN,3907,NaN,NaN,"Prince of Central Park, The (1999)",Drama,1999